Revit 2027 API
MEPAnalyticalSegment.IsSegmentOverridable Method
 Verifies if the segment can be overridden (e.g., the pressure drop of the pump and curve segments are calculated from the network and cannot be overridden).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSegmentOverridable()
Public Function IsSegmentOverridable As Boolean
public:
bool IsSegmentOverridable()
member IsSegmentOverridable : unit -> bool
Return Value
Boolean
 True if the segment can be overridden for the loss coefficient or pressure drop, false if the segment cannot be overriden.
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace